logs/countrytest.log

2026-04-13 12:33:44 [background-preinit] INFO  o.h.validator.internal.util.Version - HV000001: Hibernate Validator 8.0.3.Final
2026-04-13 12:33:44 [main] INFO  c.c.c.CountrytestApplication - Starting CountrytestApplication using Java 21.0.7 with PID 24464 (C:\Users\smuntaz\Documents\NCBAPosIntegrations\countrytest\target\classes started by smuntaz in C:\Users\smuntaz\Documents\NCBAPosIntegrations\countrytest)
2026-04-13 12:33:44 [main] INFO  c.c.c.CountrytestApplication - No active profile set, falling back to 1 default profile: "default"
2026-04-13 12:33:46 [main] INFO  o.s.d.r.c.RepositoryConfigurationDelegate - Bootstrapping Spring Data JPA repositories in DEFAULT mode.
2026-04-13 12:33:46 [main] INFO  o.s.d.r.c.RepositoryConfigurationDelegate - Finished Spring Data repository scanning in 100 ms. Found 2 JPA repository interfaces.
2026-04-13 12:33:46 [main] INFO  o.s.b.w.e.tomcat.TomcatWebServer - Tomcat initialized with port 8085 (http)
2026-04-13 12:33:46 [main] INFO  o.a.coyote.http11.Http11NioProtocol - Initializing ProtocolHandler ["http-nio-8085"]
2026-04-13 12:33:46 [main] INFO  o.a.catalina.core.StandardService - Starting service [Tomcat]
2026-04-13 12:33:46 [main] INFO  o.a.catalina.core.StandardEngine - Starting Servlet engine: [Apache Tomcat/10.1.53]
2026-04-13 12:33:47 [main] INFO  o.a.c.c.C.[Tomcat].[localhost].[/] - Initializing Spring embedded WebApplicationContext
2026-04-13 12:33:47 [main] INFO  o.s.b.w.s.c.ServletWebServerApplicationContext - Root WebApplicationContext: initialization completed in 2177 ms
2026-04-13 12:33:47 [main] INFO  o.h.jpa.internal.util.LogHelper - HHH000204: Processing PersistenceUnitInfo [name: default]
2026-04-13 12:33:47 [main] INFO  org.hibernate.Version - HHH000412: Hibernate ORM core version 6.6.45.Final
2026-04-13 12:33:47 [main] INFO  o.h.c.i.RegionFactoryInitiator - HHH000026: Second-level cache disabled
2026-04-13 12:33:47 [main] INFO  o.s.o.j.p.SpringPersistenceUnitInfo - No LoadTimeWeaver setup: ignoring JPA class transformer
2026-04-13 12:33:47 [main] INFO  com.zaxxer.hikari.HikariDataSource - HikariPool-1 - Starting...
2026-04-13 12:33:48 [main] INFO  com.zaxxer.hikari.pool.HikariPool - HikariPool-1 - Added connection conn0: url=jdbc:h2:mem:testdb user=SA
2026-04-13 12:33:48 [main] INFO  com.zaxxer.hikari.HikariDataSource - HikariPool-1 - Start completed.
2026-04-13 12:33:48 [main] INFO  o.hibernate.orm.connections.pooling - HHH10001005: Database info:
	Database JDBC URL [Connecting through datasource 'HikariDataSource (HikariPool-1)']
	Database driver: undefined/unknown
	Database version: 2.3.232
	Autocommit mode: undefined/unknown
	Isolation level: undefined/unknown
	Minimum pool size: undefined/unknown
	Maximum pool size: undefined/unknown
2026-04-13 12:33:49 [main] INFO  o.h.e.t.j.p.i.JtaPlatformInitiator - HHH000489: No JTA platform available (set 'hibernate.transaction.jta.platform' to enable JTA platform integration)
2026-04-13 12:33:49 [main] INFO  o.s.o.j.LocalContainerEntityManagerFactoryBean - Initialized JPA EntityManagerFactory for persistence unit 'default'
2026-04-13 12:33:49 [main] INFO  o.s.d.j.r.query.QueryEnhancerFactory - Hibernate is in classpath; If applicable, HQL parser will be used.
2026-04-13 12:33:50 [main] WARN  o.s.b.a.o.j.JpaBaseConfiguration$JpaWebConfiguration - spring.jpa.open-in-view is enabled by default. Therefore, database queries may be performed during view rendering. Explicitly configure spring.jpa.open-in-view to disable this warning
2026-04-13 12:33:51 [main] INFO  o.s.b.a.h.H2ConsoleAutoConfiguration - H2 console available at '/h2-console'. Database available at 'jdbc:h2:mem:testdb'
2026-04-13 12:33:51 [main] INFO  o.a.coyote.http11.Http11NioProtocol - Starting ProtocolHandler ["http-nio-8085"]
2026-04-13 12:33:51 [main] INFO  o.s.b.w.e.tomcat.TomcatWebServer - Tomcat started on port 8085 (http) with context path '/'
2026-04-13 12:33:51 [main] INFO  c.c.c.CountrytestApplication - Started CountrytestApplication in 7.847 seconds (process running for 9.212)
2026-04-13 12:33:51 [main] WARN  o.s.c.events.SpringDocAppInitializer - SpringDoc /v3/api-docs endpoint is enabled by default. To disable it in production, set the property 'springdoc.api-docs.enabled=false'
2026-04-13 12:33:51 [main] WARN  o.s.c.events.SpringDocAppInitializer - SpringDoc /swagger-ui.html endpoint is enabled by default. To disable it in production, set the property 'springdoc.swagger-ui.enabled=false'
2026-04-13 12:34:42 [http-nio-8085-exec-1] INFO  o.a.c.c.C.[Tomcat].[localhost].[/] - Initializing Spring DispatcherServlet 'dispatcherServlet'
2026-04-13 12:34:42 [http-nio-8085-exec-1] INFO  o.s.web.servlet.DispatcherServlet - Initializing Servlet 'dispatcherServlet'
2026-04-13 12:34:42 [http-nio-8085-exec-1] INFO  o.s.web.servlet.DispatcherServlet - Completed initialization in 0 ms
2026-04-13 12:34:43 [http-nio-8085-exec-1] INFO  c.c.c.service.CountryService - <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <m:FullCountryInfoResponse xmlns:m="http://www.oorsprong.org/websamples.countryinfo">
      <m:FullCountryInfoResult>
        <m:sISOCode>TZ</m:sISOCode>
        <m:sName>Tanzania</m:sName>
        <m:sCapitalCity>Dar es Salaam</m:sCapitalCity>
        <m:sPhoneCode>255</m:sPhoneCode>
        <m:sContinentCode>AF</m:sContinentCode>
        <m:sCurrencyISOCode>TZS</m:sCurrencyISOCode>
        <m:sCountryFlag>http://www.oorsprong.org/WebSamples.CountryInfo/Flags/Tanzania.jpg</m:sCountryFlag>
        <m:Languages>
          <m:tLanguage>
            <m:sISOCode>swa</m:sISOCode>
            <m:sName>Swahili</m:sName>
          </m:tLanguage>
        </m:Languages>
      </m:FullCountryInfoResult>
    </m:FullCountryInfoResponse>
  </soap:Body>
</soap:Envelope>
2026-04-13 12:34:43 [http-nio-8085-exec-1] INFO  c.c.c.service.CountryService - Languages
          
            swa
            Swahili
          
        
2026-04-13 12:35:26 [http-nio-8085-exec-2] INFO  c.c.c.controller.CountryController - Received country name: Kenya
2026-04-13 12:35:26 [http-nio-8085-exec-2] INFO  c.c.c.service.CountryService - Sending getIsoCode   request <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.oorsprong.org/websamples.countryinfo">
   <soapenv:Header/>
   <soapenv:Body>
      <web:CountryISOCode>
         <web:sCountryName>Kenya</web:sCountryName>
      </web:CountryISOCode>
   </soapenv:Body>
</soapenv:Envelope>
2026-04-13 12:35:26 [http-nio-8085-exec-2] INFO  c.c.c.service.CountryService - <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <m:CountryISOCodeResponse xmlns:m="http://www.oorsprong.org/websamples.countryinfo">
      <m:CountryISOCodeResult>KE</m:CountryISOCodeResult>
    </m:CountryISOCodeResponse>
  </soap:Body>
</soap:Envelope>
2026-04-13 12:35:34 [http-nio-8085-exec-6] INFO  c.c.c.service.CountryService - <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <m:FullCountryInfoResponse xmlns:m="http://www.oorsprong.org/websamples.countryinfo">
      <m:FullCountryInfoResult>
        <m:sISOCode>KE</m:sISOCode>
        <m:sName>Kenya</m:sName>
        <m:sCapitalCity>Nairobi</m:sCapitalCity>
        <m:sPhoneCode>254</m:sPhoneCode>
        <m:sContinentCode>AF</m:sContinentCode>
        <m:sCurrencyISOCode>KES</m:sCurrencyISOCode>
        <m:sCountryFlag>http://www.oorsprong.org/WebSamples.CountryInfo/Flags/Kenya.jpg</m:sCountryFlag>
        <m:Languages>
          <m:tLanguage>
            <m:sISOCode>swa</m:sISOCode>
            <m:sName>Swahili</m:sName>
          </m:tLanguage>
        </m:Languages>
      </m:FullCountryInfoResult>
    </m:FullCountryInfoResponse>
  </soap:Body>
</soap:Envelope>
2026-04-13 12:35:34 [http-nio-8085-exec-6] INFO  c.c.c.service.CountryService - Languages
          
            swa
            Swahili
          
        
2026-04-13 12:36:03 [SpringApplicationShutdownHook] INFO  o.s.b.w.e.tomcat.GracefulShutdown - Commencing graceful shutdown. Waiting for active requests to complete
2026-04-13 12:36:03 [tomcat-shutdown] INFO  o.s.b.w.e.tomcat.GracefulShutdown - Graceful shutdown complete
2026-04-13 12:36:03 [SpringApplicationShutdownHook] INFO  o.s.o.j.LocalContainerEntityManagerFactoryBean - Closing JPA EntityManagerFactory for persistence unit 'default'
2026-04-13 12:36:03 [SpringApplicationShutdownHook] INFO  com.zaxxer.hikari.HikariDataSource - HikariPool-1 - Shutdown initiated...
2026-04-13 12:36:03 [SpringApplicationShutdownHook] INFO  com.zaxxer.hikari.HikariDataSource - HikariPool-1 - Shutdown completed.
